# Install dir
cask_args appdir: "/Applications"

# taps
#depreciated tap "homebrew/binary"
#depreciated tap "homebrew/versions"
#tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Brews
## where the magic happens
brew "tmate"
brew "tmux"
brew "reattach-to-user-namespace"

## git tools
brew "git"
brew "git-crypt"
brew "michaeldfallen/formula/git-radar"

brew "asdf"

## aws tools
brew "awscli"

brew "aspell"
brew "openssl"
brew "curl"
brew "direnv"
brew "blueutil"
brew "dockutil"
brew "openssl@1.1"

# Casks
cask "1password"
cask "1password-cli"
cask "bartender"
cask "dash"
cask "docker"
cask "evernote"
cask "slack"
cask "witch"
cask "zoomus"
